# Pandas

In [83]:
import pandas

In [84]:
frame = pandas.DataFrame({"numbers": range(0,10), "values": "abc"})

In [85]:
frame = pandas.read_csv("pandas_dataset.tsv", sep="\t", header=0)

In [86]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [87]:
frame["Ivann"] = ["kek"] * 6

In [88]:
frame

              Name       Birth       City  Position Ivann
0      Иванов А.А.  22.03.1980     Москва       NaN   kek
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   kek
2       Белов М.М.  13.02.1980     Ростов  менеджер   kek
3  Мельникова Д.С.  15.04.1985     Ростов       NaN   kek
4      Рыбина Е.П.  19.11.1985     Москва   инженер   kek
5     Костров С.О.  31.05.1985     Москва    стажер   kek

In [89]:
frame.drop(5, inplace=True)

In [90]:
frame

              Name       Birth       City  Position Ivann
0      Иванов А.А.  22.03.1980     Москва       NaN   kek
1     Сорокин И.В.  07.08.1965  Волгоград   инженер   kek
2       Белов М.М.  13.02.1980     Ростов  менеджер   kek
3  Мельникова Д.С.  15.04.1985     Ростов       NaN   kek
4      Рыбина Е.П.  19.11.1985     Москва   инженер   kek

In [91]:
frame.drop("Ivann", axis=1, inplace=True)
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [92]:
frame.shape

(5, 4)

In [93]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [94]:
frame = frame.append({"Name": "Ivan", "Birth": "20.01.1995", "City": "Astana"}, ignore_index=True)

In [95]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5             Ivan  20.01.1995     Astana       NaN

In [96]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [97]:
frame.Birth = frame.Birth.apply(pandas.to_datetime)

In [98]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5             Ivan 1995-01-20     Astana       NaN

In [99]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [100]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    3 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 240.0+ bytes

In [101]:
frame.fillna("разнорабочий",inplace=True)

In [102]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5             Ivan 1995-01-20     Astana  разнорабочий

In [103]:
frame.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5    разнорабочий
Name: Position, dtype: object

In [106]:
frame[["Name", "Position"]]

              Name      Position
0      Иванов А.А.  разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разнорабочий
4      Рыбина Е.П.       инженер
5             Ivan  разнорабочий

In [109]:
frame.head(3)

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [110]:
frame[0:3]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [113]:
frame.loc[[0,2,4], ["Name", 'City']]

          Name    City
0  Иванов А.А.  Москва
2   Белов М.М.  Ростов
4  Рыбина Е.П.  Москва

In [116]:
frame.iloc[[0,2,4], [0,2]]

          Name    City
0  Иванов А.А.  Москва
2   Белов М.М.  Ростов
4  Рыбина Е.П.  Москва

In [117]:
frame.ix[[0,2,4], ["Name", "City"]]

          Name    City
0  Иванов А.А.  Москва
2   Белов М.М.  Ростов
4  Рыбина Е.П.  Москва

In [118]:
frame.ix[[0,2,4], [0,2]]

          Name    City
0  Иванов А.А.  Москва
2   Белов М.М.  Ростов
4  Рыбина Е.П.  Москва

In [119]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5             Ivan 1995-01-20     Astana  разнорабочий

In [125]:
frame[frame.Birth >= pandas.to_datetime("01.01.1985")]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5             Ivan 1995-01-20  Astana  разнорабочий

In [129]:
frame[((frame.Birth >= pandas.to_datetime("01.01.1985")) & (frame.Position == "разнорабочий")) | (frame.City == "Москва")]

              Name      Birth    City      Position
0      Иванов А.А. 1980-03-22  Москва  разнорабочий
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5             Ivan 1995-01-20  Astana  разнорабочий